package nowcoder;
// 请实现一个函数用来判断字符串是否表示数值（包括正负整数和正负小数）。

// 例如，字符串"+100","5e2","-123","3.1416"和"-1E-16"都表示数值。 
// 但是"12e","1a3.14","1.2.3","+-5"和"12e+4.3"都不是。

public class Nowcoder53 {
    // 方法1:使用编译原理中的确定有穷自动机DFA(determined finite automation)
    // 思路:先确定可能输入的符号集合,并进行分类,如符号位(+/-),数字(0-9)等.然后根据
    // 不同的类型的符号作为输入,记录状态的变化,并将变化的状态总结成状态矩阵,矩阵类型
    // 为char[][].
    char states[][] = new char[][] {
            // [+,-],[E,e],[0-9],[.],[&],[Other]
            // PS:&表示字符串结尾
            { '1', 'F', '2', 'F', 'F', 'F' }, 
            { 'F', 'F', '2', 'F', 'F', 'F' }, 
            { 'F', '3', '2', '4', 'T', 'F' },
            { '5', 'F', '6', 'F', 'F', 'F' }, 
            { 'F', 'F', '7', 'F', 'F', 'F' }, 
            { 'F', 'F', '6', 'F', 'F', 'F' },
            { 'F', 'F', '6', 'F', 'T', 'F' }, 
            { 'F', 'F', '7', 'F', 'T', 'F' } 
        };

    public boolean isNumeric(char[] str) {
        // 排除特殊情况
        if ( str == null || str.length == 0) return false;
        
        return false;
    }
}